contrib-imola/cics-bc/jbi4cics/src/test/resources/xmlmessages/testVinciMessage.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:provaVinciOperation xmlns:m="http://generators.utils.webservices.test.jbi4cics.imolinfo.it">
			<m:in0>
				<m:binStrlen>0</m:binStrlen>
				<m:compStrlen>0</m:compStrlen>
				<m:inputString>Hello World</m:inputString>
				<m:plusZonedStrlen>0</m:plusZonedStrlen>
				<m:signedZonedStrlen>0</m:signedZonedStrlen>
				<m:strlen>0</m:strlen>
				<m:zonedStrlen>0</m:zonedStrlen>
			</m:in0>
		</m:provaVinciOperation>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
